## 案例分析一：Kaggle Competition | Titanic Machine Learning from Disaster



***本作基于： [Titanic](https://github.com/agconti/kaggle-titanic). 原数据来源： [Kaggle.com](http://www.kaggle.com/c/titanic-gettingStarted).***

In [3]:
import numpy as np
import pandas as pd

#### `import … as …`是给我们引入的包加上缩写，在后续调用的时候可以直接用缩写调用

In [4]:
df = pd.read_csv("train.csv")

In [6]:
df #直接打变量名字就可以预览数据内容

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [9]:
df = df.drop(['Ticket','Cabin'], axis=1)
df = df.dropna()

#### `.drop()`是用于删除整一列数据，不作额外判断。  
* 如果将`axis`参数改为1 (默认为0)，则会沿纵向删除数据  
#### `.dropna()`用于删除空值NaN  
* 在不额外调整`axis`参数值时，同样默认遍历全部行进行删除

## 案例分析二： Data Cleaning with NumPy and Pandas
  
***本作基于： [Data-cleaning](https://github.com/mramshaw/Data-Cleaning). 原数据来源： [Pandas and NumPy](https://realpython.com/python-data-cleaning-numpy-pandas/).***

In [ ]:
import pandas as pd
import numpy as np

In [11]:
df = pd.read_csv('BL-Flickr-Images-Book.csv')
df.head()

#### `df.head()`意为预览前五列数据
* 括号中定义数字可以预览更多行的数据

In [12]:
to_drop = ['Edition Statement',
          'Corporate Author',
          'Corporate Contributors',
          'Former owner',
          'Engraver',
          'Contributors',
          'Issuance type',
          'Shelfmarks']
df.drop(to_drop, inplace=True, axis=1)
df.head()

#### `df.drop(labels= ，inplace=false，axis=0，errors='raise')`是drop函数的部分语法默认值
* labels：在这里用`to_drop`统一标注想要删除的列；在较小的数据集中，可以直接用字符串标明需要删除的列名
* axis：默认值为0，按纵向删除；在此改为1，按列方向删除
* inplace：默认值为`false`；如果将参数改为`True`，将会直接覆盖原数据，操作不可逆
* errors：默认值为`'raise'`，此时如果出现不存在的列名则返回`KeyError`；参数改为'ignore'便可以忽略打错的列名

In [10]:
df['Identifier'].is_unique

True

#### `df['Identifier'].is_unique` 是测试某列名是否是唯一的，因为我们想要把在后续以这个列名为基础查看数据

In [ ]:
df = df.set_index('Identifier')
df.head()

#### `df.set_index('Identifier')` 是将检索值固定为了我们想要的，替换掉了默认的0,1,2…

In [ ]:
df.loc[216]